src/Catalogs/ВидыБонусныхСчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ВидыБонусныхСчетов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Именной</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеНачислятьПриОплатеБонусами</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеОграниченПроцентомСписания</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОграничениеНачисленийПоСрокуДействия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыОграниченийСрокаДействия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОграничениеПоСрокуДействия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыОграниченийСрокаДействия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОграничениеСписанияПроцент</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СегментНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СегментыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокДействия</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокДействияДатойПо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокДействияДатойС</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокДействияНачислений</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокДействияНачисленийТип</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Периодичность</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокДействияТип</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Периодичность</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаНачисленияВДеньРождения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаПриветственногоНачисления</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КурсОбмена</Name>
					<Comment>Курс конвертации SKLLZZ</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПакетУслугСоставУслуг</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>УслугаСегмент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СегментыНоменклатуры</v8:Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидЦены</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентСписания</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Enums/ТипыОграниченийСрокаДействия.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ТипыОграниченийСрокаДействия</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Бессрочный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СрокДействия_С_По</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СрокОграниченПериодом</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/Периодичность.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>Периодичность</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Минута</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Час</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>День</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Неделя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Декада</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Месяц</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Квартал</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Полугодие</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Год</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Catalogs/ВидыБонусныхСчетов/Ext/ManagerModule.bsl
#Область СлужебныйПрограммныйИнтерфейс

//
//
Процедура ПолучитьСтруктуруНастроекВидаБонусногоСчета(Знач ВидБонусногоСчета, СтруктураНастроекБС) Экспорт

	Если СтруктураНастроекБС = Неопределено ИЛИ ТипЗнч(СтруктураНастроекБС) <> Тип("Структура")Тогда 
		СтруктураНастроекБС = Новый Структура;
	ИначеЕсли ТипЗнч(СтруктураНастроекБС) = Тип("Структура") Тогда 
		СтруктураНастроекБС.Очистить();
	КонецЕсли;
	
	ВидБСЗаполнен = ЗначениеЗаполнено(ВидБонусногоСчета);
	
	СтруктураНастроекБС.Вставить("Именной"								, ?(ВидБСЗаполнен, ВидБонусногоСчета.Именной, Ложь));
	СтруктураНастроекБС.Вставить("НеОграниченПроцентомСписания"			, ?(ВидБСЗаполнен, ВидБонусногоСчета.НеОграниченПроцентомСписания, Истина));
	СтруктураНастроекБС.Вставить("ОграничениеНачисленийПоСрокуДействия"	, ?(ВидБСЗаполнен, ВидБонусногоСчета.ОграничениеНачисленийПоСрокуДействия, Перечисления.ТипыОграниченийСрокаДействия.Бессрочный));
	СтруктураНастроекБС.Вставить("ОграничениеПоСрокуДействия"			, ?(ВидБСЗаполнен, ВидБонусногоСчета.ОграничениеПоСрокуДействия, Перечисления.ТипыОграниченийСрокаДействия.Бессрочный));
	СтруктураНастроекБС.Вставить("ОграничениеСписанияПроцент"			, ?(ВидБСЗаполнен, ВидБонусногоСчета.ОграничениеСписанияПроцент, 0));
	СтруктураНастроекБС.Вставить("СегментНоменклатуры"					, ?(ВидБСЗаполнен, ВидБонусногоСчета.СегментНоменклатуры, Справочники.СегментыНоменклатуры.ПустаяСсылка()));
	СтруктураНастроекБС.Вставить("СрокДействия"							, ?(ВидБСЗаполнен, ВидБонусногоСчета.СрокДействия, 0));
	СтруктураНастроекБС.Вставить("СрокДействияДатойС"					, ?(ВидБСЗаполнен, ВидБонусногоСчета.СрокДействияДатойС, Дата(1,1,1)));
	СтруктураНастроекБС.Вставить("СрокДействияДатойПо"					, ?(ВидБСЗаполнен, ВидБонусногоСчета.СрокДействияДатойПо, Дата(1,1,1)));
	СтруктураНастроекБС.Вставить("СрокДействияНачислений"				, ?(ВидБСЗаполнен, ВидБонусногоСчета.СрокДействияНачислений, 0));
	СтруктураНастроекБС.Вставить("СрокДействияНачисленийТип"			, ?(ВидБСЗаполнен, ВидБонусногоСчета.СрокДействияНачисленийТип, Перечисления.Периодичность.День));
	СтруктураНастроекБС.Вставить("СрокДействияТип"						, ?(ВидБСЗаполнен, ВидБонусногоСчета.СрокДействияТип, Перечисления.Периодичность.День));
	СтруктураНастроекБС.Вставить("СуммаНачисленияВДеньРождения"			, ?(ВидБСЗаполнен, ВидБонусногоСчета.СуммаНачисленияВДеньРождения, 0));
	
КонецПроцедуры

//
//
Функция ВернутьВидыБонусныхСчетов() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ВидыБонусныхСчетов.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.ВидыБонусныхСчетов КАК ВидыБонусныхСчетов
	               |ГДЕ
	               |	НЕ ВидыБонусныхСчетов.ПометкаУдаления";
			
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции

// Функция создает или возвращает существующий вид бонусного счета SKLLZZ.
//
Функция ПолучитьСоздатьВидБонусногоСчетаSKLLZZ(ВнешняяСистема) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ВнешняяСистема) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВидыБонусныхСчетов.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ВидыБонусныхСчетов КАК ВидыБонусныхСчетов
	|ГДЕ
	|	НЕ ВидыБонусныхСчетов.ПометкаУдаления
	|	И ВидыБонусныхСчетов.ВнешняяСистема = &ВнешняяСистема";
	Запрос.УстановитьПараметр("ВнешняяСистема", ВнешняяСистема);
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		
		ПараметрыВнешнейСистемы = ВнешняяСистема.Параметры.Получить();
		
		Если ТипЗнч(ПараметрыВнешнейСистемы) = Тип("Структура") Тогда
			
			ВидБС = Справочники.ВидыБонусныхСчетов.СоздатьЭлемент();
			Если ПараметрыВнешнейСистемы.Свойство("ПакетУслугСоставУслуг") Тогда
				ВидБС.ПакетУслугСоставУслуг.Загрузить(ПараметрыВнешнейСистемы.ПакетУслугСоставУслуг);	
			КонецЕсли;
			
			ВидБС.Наименование 					= ПараметрыВнешнейСистемы.НаименованиеВидаБонусногоСчета;
			ВидБС.ОграничениеСписанияПроцент 	= ПараметрыВнешнейСистемы.ОграничениеСписанияПроцент;
			ВидБС.НеОграниченПроцентомСписания 	= ПараметрыВнешнейСистемы.НеОграниченПроцентомСписания;
			ВидБС.КурсОбмена 					= ПараметрыВнешнейСистемы.КурсОбмена;
			// ВидБС.Внешний 						= Истина;
			ВидБС.Именной 						= Истина;
			ВидБС.ВнешняяСистема 				= ВнешняяСистема;		
			ВидБС.ОграничениеПоСрокуДействия 	= Перечисления.ТипыОграниченийСрокаДействия.Бессрочный;
			ВидБС.ОграничениеНачисленийПоСрокуДействия 	= Перечисления.ТипыОграниченийСрокаДействия.Бессрочный;
			
			ВидБС.Записать();
			
			Возврат ВидБС.Ссылка;
			
		Иначе
			Возврат Неопределено;			
		КонецЕсли;
		
	Иначе
		
		ВыборкаЗапроса = РезультатЗапроса.Выбрать();
		Возврат ?(ВыборкаЗапроса.Следующий(), ВыборкаЗапроса.Ссылка, Справочники.ВидыБонусныхСчетов.ПустаяСсылка());
		
	КонецЕсли;
		
КонецФункции

#КонецОбласти
